app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <div class="col-sm-8 offset-sm-8">
            <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>