app/controllers/articles_controller.rb

SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 2)