app/controllers/articles_controller.rb

  def create
    @article = Article.new params_article
    @article.user = User.first
    if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New User"], ["description", "New User UI/UX"], ["created_at", "2017-09-04 03:44:29.394221"], ["updated_at", "2017-09-04 03:44:29.394221"], ["user_id", 1]]

  def update
    if @article.update(params_article)
---
UPDATE "articles" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "new 1"], ["description", "new on ui , edited..."], ["updated_at", "2017-08-26 12:28:54.252442"], ["id", 7]]

  def set_params
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]