app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page:4)
---
SELECT  "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def create
    @category = Category.new category_params
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Ruby"], ["created_at", "2017-09-12 03:35:43.614255"], ["updated_at", "2017-09-12 03:35:43.614255"]]

  def show
    @category = Category.find(params[:id])
    @category_articles = @category.articles.paginate(page: params[:page], per_page:4 )
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 2], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 2]]