app/controllers/users_controller.rb

  def index
    #@users = User.all
    @users = User.paginate(page: params[:page], per_page: 2)
---
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "john2"], ["password_digest", "$2a$10$GorTNQE25m4bRvpO/89.IOaXK8HTGN403robSlL.sf1VaHfgLtWTS"], ["updated_at", "2017-09-04 12:48:43.561075"], ["id", 5]]

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 2)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]